backend/jmeter.log
2025-11-22 16:10:17,198 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-11-22 16:10:17,208 INFO o.a.j.JMeter: Loading user properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/user.properties
2025-11-22 16:10:17,209 INFO o.a.j.JMeter: Loading system properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/system.properties
2025-11-22 16:10:17,212 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-11-22 16:10:17,212 INFO o.a.j.JMeter: Version 5.6.3
2025-11-22 16:10:17,212 INFO o.a.j.JMeter: java.version=21.0.9
2025-11-22 16:10:17,212 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-11-22 16:10:17,212 INFO o.a.j.JMeter: os.name=Mac OS X
2025-11-22 16:10:17,212 INFO o.a.j.JMeter: os.arch=aarch64
2025-11-22 16:10:17,212 INFO o.a.j.JMeter: os.version=26.0.1
2025-11-22 16:10:17,212 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-11-22 16:10:17,212 INFO o.a.j.JMeter: java.awt.headless=true
2025-11-22 16:10:17,212 INFO o.a.j.JMeter: Max memory     =1073741824
2025-11-22 16:10:17,212 INFO o.a.j.JMeter: Available Processors =8
2025-11-22 16:10:17,217 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-11-22 16:10:17,217 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-11-22 16:10:17,217 INFO o.a.j.JMeter: JMeterHome=/opt/homebrew/Cellar/jmeter/5.6.3/libexec
2025-11-22 16:10:17,217 INFO o.a.j.JMeter: user.dir  =/Users/manjotkaur/Desktop/CodeNest/JotX/Airbnb_Lab1-airbnb/backend
2025-11-22 16:10:17,217 INFO o.a.j.JMeter: PWD       =/Users/manjotkaur/Desktop/CodeNest/JotX/Airbnb_Lab1-airbnb/backend
2025-11-22 16:10:17,219 INFO o.a.j.JMeter: IP: 127.0.0.1 Name: Manjots-MacBook-Pro.local FullName: localhost
2025-11-22 16:10:17,227 INFO o.a.j.s.FileServer: Default base='/Users/manjotkaur/Desktop/CodeNest/JotX/Airbnb_Lab1-airbnb/backend'
2025-11-22 16:10:17,227 INFO o.a.j.s.FileServer: Set new base='/Users/manjotkaur/Desktop/CodeNest/JotX/Airbnb_Lab1-airbnb/backend'
2025-11-22 16:10:17,300 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-11-22 16:10:17,321 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-11-22 16:10:17,322 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-11-22 16:10:17,323 INFO o.a.j.s.SaveService: Loading file: airbnb-performance.jmx
2025-11-22 16:10:17,350 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-22 16:10:17,350 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-22 16:10:17,350 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-22 16:10:17,350 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-22 16:10:17,350 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-11-22 16:10:17,350 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-11-22 16:10:17,354 INFO o.a.j.JMeter: Creating summariser <summary>
2025-11-22 16:10:17,363 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-11-22 16:10:17,364 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-11-22 16:10:17,364 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-11-22 16:10:17,365 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-11-22 16:10:17,365 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-11-22 16:10:17,388 INFO o.a.j.r.ClassFinder: Will scan jar /opt/homebrew/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-plugins-manager-1.9.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-11-22 16:10:17,426 INFO o.a.j.JMeter: Running test (1763856617426)
2025-11-22 16:10:17,433 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Concurrent Users
2025-11-22 16:10:17,433 INFO o.a.j.e.StandardJMeterEngine: Starting 50 threads for group Concurrent Users.
2025-11-22 16:10:17,433 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-11-22 16:10:17,434 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=50 ramp-up=5 delayedStart=false
2025-11-22 16:10:17,436 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-1
2025-11-22 16:10:17,440 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-11-22 16:10:17,440 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-11-22 16:10:17,444 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Manjots-MacBook-Pro.local
2025-11-22 16:10:17,447 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-11-22 16:10:17,447 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-11-22 16:10:17,447 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-11-22 16:10:17,447 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-11-22 16:10:17,447 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-11-22 16:10:17,540 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-2
2025-11-22 16:10:17,622 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-1
2025-11-22 16:10:17,622 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-1
2025-11-22 16:10:17,623 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-2
2025-11-22 16:10:17,623 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-2
2025-11-22 16:10:17,640 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-3
2025-11-22 16:10:17,654 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-3
2025-11-22 16:10:17,654 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-3
2025-11-22 16:10:17,740 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-4
2025-11-22 16:10:17,761 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-4
2025-11-22 16:10:17,761 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-4
2025-11-22 16:10:17,838 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-5
2025-11-22 16:10:17,854 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-5
2025-11-22 16:10:17,854 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-5
2025-11-22 16:10:17,936 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-6
2025-11-22 16:10:17,954 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-6
2025-11-22 16:10:17,954 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-6
2025-11-22 16:10:18,039 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-7
2025-11-22 16:10:18,058 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-7
2025-11-22 16:10:18,058 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-7
2025-11-22 16:10:18,139 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-8
2025-11-22 16:10:18,169 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-8
2025-11-22 16:10:18,169 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-8
2025-11-22 16:10:18,239 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-9
2025-11-22 16:10:18,261 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-9
2025-11-22 16:10:18,261 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-9
2025-11-22 16:10:18,339 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-10
2025-11-22 16:10:18,368 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-10
2025-11-22 16:10:18,368 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-10
2025-11-22 16:10:18,438 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-11
2025-11-22 16:10:18,456 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-11
2025-11-22 16:10:18,456 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-11
2025-11-22 16:10:18,540 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-12
2025-11-22 16:10:18,574 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-12
2025-11-22 16:10:18,574 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-12
2025-11-22 16:10:18,640 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-13
2025-11-22 16:10:18,675 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-13
2025-11-22 16:10:18,676 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-13
2025-11-22 16:10:18,740 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-14
2025-11-22 16:10:18,758 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-14
2025-11-22 16:10:18,758 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-14
2025-11-22 16:10:18,839 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-15
2025-11-22 16:10:18,869 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-15
2025-11-22 16:10:18,869 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-15
2025-11-22 16:10:18,939 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-16
2025-11-22 16:10:18,976 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-16
2025-11-22 16:10:18,976 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-16
2025-11-22 16:10:19,039 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-17
2025-11-22 16:10:19,069 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-17
2025-11-22 16:10:19,069 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-17
2025-11-22 16:10:19,140 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-18
2025-11-22 16:10:19,178 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-18
2025-11-22 16:10:19,178 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-18
2025-11-22 16:10:19,239 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-19
2025-11-22 16:10:19,267 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-19
2025-11-22 16:10:19,267 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-19
2025-11-22 16:10:19,339 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-20
2025-11-22 16:10:19,372 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-20
2025-11-22 16:10:19,372 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-20
2025-11-22 16:10:19,440 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-21
2025-11-22 16:10:19,479 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-21
2025-11-22 16:10:19,479 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-21
2025-11-22 16:10:19,536 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-22
2025-11-22 16:10:19,555 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-22
2025-11-22 16:10:19,555 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-22
2025-11-22 16:10:19,639 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-23
2025-11-22 16:10:19,658 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-23
2025-11-22 16:10:19,658 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-23
2025-11-22 16:10:19,735 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-24
2025-11-22 16:10:19,755 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-24
2025-11-22 16:10:19,755 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-24
2025-11-22 16:10:19,840 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-25
2025-11-22 16:10:19,860 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-25
2025-11-22 16:10:19,860 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-25
2025-11-22 16:10:19,937 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-26
2025-11-22 16:10:19,954 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-26
2025-11-22 16:10:19,954 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-26
2025-11-22 16:10:20,037 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-27
2025-11-22 16:10:20,050 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-27
2025-11-22 16:10:20,050 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-27
2025-11-22 16:10:20,139 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-28
2025-11-22 16:10:20,159 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-28
2025-11-22 16:10:20,159 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-28
2025-11-22 16:10:20,240 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-29
2025-11-22 16:10:20,291 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-29
2025-11-22 16:10:20,291 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-29
2025-11-22 16:10:20,338 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-30
2025-11-22 16:10:20,391 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-30
2025-11-22 16:10:20,392 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-30
2025-11-22 16:10:20,439 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-31
2025-11-22 16:10:20,451 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-31
2025-11-22 16:10:20,452 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-31
2025-11-22 16:10:20,537 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-32
2025-11-22 16:10:20,554 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-32
2025-11-22 16:10:20,554 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-32
2025-11-22 16:10:20,637 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-33
2025-11-22 16:10:20,672 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-33
2025-11-22 16:10:20,672 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-33
2025-11-22 16:10:20,739 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-34
2025-11-22 16:10:20,795 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-34
2025-11-22 16:10:20,795 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-34
2025-11-22 16:10:20,840 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-35
2025-11-22 16:10:20,861 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-35
2025-11-22 16:10:20,861 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-35
2025-11-22 16:10:20,939 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-36
2025-11-22 16:10:20,978 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-36
2025-11-22 16:10:20,978 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-36
2025-11-22 16:10:21,038 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-37
2025-11-22 16:10:21,085 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-37
2025-11-22 16:10:21,085 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-37
2025-11-22 16:10:21,139 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-38
2025-11-22 16:10:21,203 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-38
2025-11-22 16:10:21,203 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-38
2025-11-22 16:10:21,235 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-39
2025-11-22 16:10:21,270 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-39
2025-11-22 16:10:21,270 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-39
2025-11-22 16:10:21,339 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-40
2025-11-22 16:10:21,380 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-40
2025-11-22 16:10:21,380 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-40
2025-11-22 16:10:21,438 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-41
2025-11-22 16:10:21,493 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-41
2025-11-22 16:10:21,493 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-41
2025-11-22 16:10:21,539 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-42
2025-11-22 16:10:21,589 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-42
2025-11-22 16:10:21,590 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-42
2025-11-22 16:10:21,640 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-43
2025-11-22 16:10:21,668 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-43
2025-11-22 16:10:21,668 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-43
2025-11-22 16:10:21,740 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-44
2025-11-22 16:10:21,769 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-44
2025-11-22 16:10:21,769 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-44
2025-11-22 16:10:21,838 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-45
2025-11-22 16:10:21,887 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-45
2025-11-22 16:10:21,887 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-45
2025-11-22 16:10:21,937 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-46
2025-11-22 16:10:21,956 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-46
2025-11-22 16:10:21,956 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-46
2025-11-22 16:10:22,035 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-47
2025-11-22 16:10:22,087 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-47
2025-11-22 16:10:22,088 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-47
2025-11-22 16:10:22,134 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-48
2025-11-22 16:10:22,182 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-48
2025-11-22 16:10:22,182 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-48
2025-11-22 16:10:22,239 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-49
2025-11-22 16:10:22,288 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-49
2025-11-22 16:10:22,288 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-49
2025-11-22 16:10:22,339 INFO o.a.j.t.JMeterThread: Thread started: Concurrent Users 1-50
2025-11-22 16:10:22,377 INFO o.a.j.t.JMeterThread: Thread is done: Concurrent Users 1-50
2025-11-22 16:10:22,377 INFO o.a.j.t.JMeterThread: Thread finished: Concurrent Users 1-50
2025-11-22 16:10:22,377 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-11-22 16:10:22,379 INFO o.a.j.r.Summariser: summary =    500 in 00:00:05 =  101.0/s Avg:     3 Min:     0 Max:   137 Err:     0 (0.00%)